#define _CRT_SECURE_NO_WARNINGS 1 
//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//一鼓作气，考研是一种忍耐！！！
#include <stdio.h>


/*
数组
要存储1 - 10的数字，怎么存储？
C语言中给了数组的定义：一组相同类型元素的集合
*/


//int main()
//{
//	/*int a = 1;
//	int b = 2;
//	int c = 3;
//	int d = 4;*/
//	int arr[10]={1,2,3,4,5,6,7,8,9,10};//定义一个存放10个整型数字的数组,语法规定索引从0开始
//	printf("%d\n", arr[4]);  //索引访问元素
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d", arr[i]);
//		i++;
//	}
//	//char ch[20];
//	//float arr2[5];
//	return 0;
//}


