//#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

//一个数如果恰好等于它的因子之和，这个数就称为“完数”。例如 6=1＋2＋3
//int main()
//{
//	int n = 1, i, sum;//定义一个存放因子和的变量，以及需要循环判断的起始数n，和循环条件用到的i
//	while (n != 1000)//此循环中的2~100就是循环的内容，
//	{
//		n++, sum = 0;//每次n增加1，并将sum清零
//		for (i = 1; i < n; i++)
//		{
//			if (n % i == 0)//循环条件找出因子i并累加
//				sum += i;
//		}
//		if (n == sum)
//			printf("%d ", n);
//	}
//	return 0;
//}
//
//
//
//int main()
//{
//	int i, j, sum;
//	for (i = 2; i <= 1000; i++)
//	{
//		sum = 1; //初始化sum
//		for (j = 2; j <= i / 2; j++) //从2开始，1不是完数
//		{
//			if (i % j == 0)
//			{
//				sum += j;
//			}
//		}
//		if (sum == i)
//		{
//			printf("%d its factors are 1 ", i);//找到完数，感觉是为了“，”处理方便，所以在这里的末尾加了1
//		}
//		if (sum == i)
//		{
//			for (j = 2; j <= i / 2; j++)
//			{
//				if (i % j == 0)printf(",%d ", j);//找到完数的因子
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}
//
//
///*水仙花数是指各位数字的立方和等于该本身的三位数。例如，153是水仙花数，因为153 = 1³ + 3³ + 5³.请编程计算并输出所有的水仙花数。*/ 
//
//main()
//{
//	//法一： 
//	int i, j, k, n;
//	for (n = 100; n < 1000; n++)
//	{
//		i = n / 100;
//		j = (n - i * 100) / 10;
//		k = n % 10;
//		if (n == i * i * i + j * j * j + k * k * k)
//			printf("%6d", n);
//	}
//	printf("\n");
//	//法二：
//	for (i = 1; i <= 9; i++)
//	{
//		for (j = 0; j <= 9; j++)
//		{
//			for (k = 0; k <= 9; k++)
//			{
//				if (i * 100 + j * 10 + k == i * i * i + j * j * j + k * k * k)
//					printf("%6d", i * 100 + j * 10 + k);
//			}
//		}
//	}
//	printf("\n");
//}
