#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
/*
C语言实现将一个二维数组行和列的元素互换，存到另一个二维数组中。
a数组的序列：
1 2 3
4 5 6
b数组的序列:
1 4
2 5
3 6
*/ 

//int main()//主函数 
//{
//    int i, j;//定义整型变量 
//    int a[2][3] = { {1,2,3},{4,5,6} };//定义二维数组，且赋初值 
//    int b[3][2];//定义二维数组
//    printf("横向数组的序列：\n");
//    for (i = 0; i <=1; i++)//共2行 
//    {
//        for (j = 0; j <= 2; j++)//共3列 
//        {
//            printf("%6d", a[i][j]);//输出数组元素值
//            b[j][i] = a[i][j];//赋值 
//        }
//        printf("\n");//换行 
//    }
//
//    printf("纵向数组的序列:\n");
//    for (i = 0; i <= 2; i++)//共3行 
//    {
//        for (j = 0; j <= 1; j++)//共2列 
//        {
//            printf("%6d", b[i][j]);//输出数组元素值
//        }
//        printf("\n");//换行
//    }
//    return 0;
//}
//int main()
//{
//	int i,j,a[2][3] = { {1,2,3},{4,5,6} },b[3][2];
//	for (i = 0; i < 2; i++)
//	{
//		for (j = 0; j < 3; j++)
//		{
//			b[j][i]=a[i][j];
//		}
//	}
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 2; j++)
//		{
//			printf("%6d",b[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}