//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

/*
1. 什么是语句？
C语句可分为以下五类：
1. 表达式语句
2. 函数调用语句
3. 控制语句
4. 复合语句
5. 空语句
本周后面介绍的是控制语句。
控制语句用于控制程序的执行流程，以实现程序的各种结构方式，它们由特定的语句定义符组成，C语
言有九种控制语句。
可分成以下三类：
1. 条件判断语句也叫分支语句：if语句、switch语句；
2. 循环执行语句：do while语句、while语句、for语句；
3. 转向语句：break语句、goto语句、continue语句、return语句。
*/

//int main()
//{
//	int a = 0;//有分号结束的叫语句
//	;//是语句--空语句
//	return 0;
//}