//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

//分支语句（选择结构）
//如果你好好学习，校招时拿一个好offer，走上人生巅峰。
//如果你不学习，毕业等于失业，回家卖红薯。
//这就是选择！

/*
if语句
那if语句的语法结构是怎么样的呢？


语法结构：
if (表达式)
   语句;
if (表达式)
   语句1;
else
   语句2;


多分支    
if (表达式1)
   语句1;
else if (表达式2)
   语句2;
else
   语句3;

解释一下：
如果表达式的结果为真，则语句执行。
在C语言中如何表示真假？
0表示假，非0表示真。
*/


////单分支
//int main()
//{
//	int age = 10;
//	if (age < 18)
//		printf("未成年\n");
//	return 0;
//}
//
////双分支
//int main()
//{
//	int age = 10;
//	if (age < 18)
//		printf("未成年\n");
//	else
//		printf("成年\n");
//	return 0;
//}

////多分支
//int main()
//{
//	int age = 1000;
//	if (age < 18)
//		printf("未成年\n");
//	else if (age >= 18 && age < 28)//&&--并且，(18 <= age < 28)这种写法错误
//		printf("青年\n");
//	else if (age >= 28 && age < 50)
//		printf("壮年\n");
//	else if (age >= 50 && age < 90)
//		printf("老年\n");
//	else
//		printf("老不死的\n");
//	return 0;
//}

//int main()
//{
//	int age = 10;
//	if (age < 18)
//		printf("未成年\n");
//	else
//	{
//		if (age >= 18 && age < 28)
//		printf("青年\n");
//		else if (age >= 28 && age < 50)
//		printf("壮年\n");
//		else if (age >= 50 && age < 90)
//		printf("老年\n");
//		else
//		printf("老不死的\n");
//	}
//	return 0;
//}



//如果条件成立，要执行多条语句，应该使用代码块。
//这里的一对{ } 就是一个代码块。
//
//int main()
//{
//	if (表达式)
//	{
//		语句列表1；
//	}
//	else
//	{
//		语句列表2；
//	}
//	return 0;
//}


//int main()
//{
//	int age = 10;
//	if (age < 18)
//	{
//		printf("未成年\n");
//		printf("不能谈恋爱");
//	}//如果不加{}，则语法错误
//	else
//	{
//		if (age >= 18 && age < 28)
//		printf("青年\n");
//		else if (age >= 28 && age < 50)
//		printf("壮年\n");
//		else if (age >= 50 && age < 90)
//		printf("老年\n");
//		else
//		printf("老不死的\n");
//	}
//	return 0;
//}


//-----------------------------------------------------------------------------------------------------------------

//悬空else


//当你写了这个代码：
//int main()
//{
//	int a = 0;
//	int b = 2;
//	if (a == 1)
//		if (b == 2)
//			printf("hehe\n");
//	else
//		printf("haha\n");//在没有{}的情况下，else和离得最近的未匹配的if相匹配--就近原则，和下面这种写法等价
//	
//	//if (a == 1)
//	//	if (b == 2)
//	//		printf("hehe\n");
//	//	else
//	//		printf("haha\n");
//		
//	return 0;
//}


//改正
//适当的使用{}可以使代码的逻辑更加清楚。
//代码风格很重要
//int main()
//{
//	int a = 0;
//	int b = 2;
//	if (a == 1)
//	{
//		if (b == 2)
//		{
//			printf("hehe\n");
//		}
//	}
//	else
//	{
//		printf("haha\n");//用{}括住之后，即使上面的if离得最近，也无法匹配
//	}
//	return 0;
//}

//-------------------------------------------------------------------------------------------------------------
//if书写形式的对比

////代码1
//if (condition) 
//{
//	return x;
//}
//return y;//如果condition成立，则输出x，否则输出y，else被省略，但是从形式上来看容易引人误解
//
//
////代码2
//if (condition) 
//{
//	return x;
//}
//else
//{
//	return y;//比代码1更加清晰，不会引起误解
//}
//
//
////代码3
//int num = 1;
//if (num == 5) //写=不会报错，仍会输出；写==也不会报错，也会输出。=--是赋值，而==--是判断相等
//{
//	printf("hehe\n");
//}
//
//
////代码4
//int num = 1;
//if (5 == num)//反着写的好处，如果写=，就会报错，num不可能赋给5；写==就是判断相等，没有语法错误
//{
//	printf("hehe\n");
//}

//----------------------------------------------------------------------------------------------------------------------
//练习：
//1. 判断一个数是否为奇数     2. 输出1 - 100之间的奇数
//int main()
//{
//	int a = 0;
//    scanf("%d", &a);
//	if (a % 2 == 1)
//		printf("a是奇数\n");
//	else
//		printf("a是偶数\n");
//	return 0;
//}

//2. 输出1 - 100之间的奇数
//int main()
//{
//	int i = 1;
//	while (i <= 100)
//	{
//		if (i%2 == 1)//i%2 != 0也可以
//			printf("%d ", i);
//		i++;
//	}
//	return 0;
//}


//没有判断语句也可完成任务
//int main()
//{
//	int i = 1;
//	while (i <= 100)
//	{
//		printf("%d ", i);
//		i += 2;
//	}
//	return 0;
//} 

