//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
//int main()
//{
//	int i = 0;//循环变量的初始化
//	while (i <= 100)//循环变量的判断
//	{
//		printf("%d ", i);
//		i++;//循环变量的调整
//	}
//	return 0;
//}


/*
看for循环的语法：
语法
for (表达式1; 表达式2; 表达式3)
循环语句;

表达式1
表达式1为初始化部分，用于初始化循环变量的。
表达式2
表达式2为条件判断部分，用于判断循环时候终止。
表达式3
表达式3为调整部分，用于循环条件的调整。
*/

//int main()
//{
//	int i = 0;
//	//for(i=1/*初始化*/; i<=10/*判断部分*/; i++/*调整部分*/)
//	for (i = 1; i <= 10; i++)
//	{
//		printf("%d ", i);
//	}
//	return 0;
//}



//--------------------------------------------------------------------------------------
//在for循环中也可以出现break和continue，他们的意义和在while循环中是一样的。
//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		if (i == 5)
//			break;//终止循环
//		printf("%d ", i);
//	}
//	return 0;
//}

//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		if (i == 5)
//			continue;//i==5跳出本次循环后面的代码，执行i++,与while不同，相当于i++写到上面的while循环
//		printf("%d ", i);
//	}
//	return 0;
//}

//------------------------------------------------------------------------------------------------------
//for语句的循环控制变量

//建议：
//1. 不可在for 循环体内修改循环变量，防止 for 循环失去控制。

//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		if (i = 5)//i被改成5，而不是判断i是5，所以每一次i都会被改成5，陷入死循环
//			printf("haha\n");
//		printf("hehe\n");
//	}
//	return 0;
//}


//2. 建议for语句的循环控制变量的取值采用“前闭后开区间”写法。
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	for (i = 0; i <= 9; i++)//建议不要写i<10,因为有时他表示循环次数
//	{
//		printf("%d", arr[i]);
//	}
//	return 0;
//}

//----------------------------------------------------------------------------
//一些for循环的变种



//代码1
//int main()
//{
//	
//	for (;;)
//	{
//		printf("hehe\n");
//	}
//}
/*for循环中的初始化部分，判断部分，调整部分是可以省略的，但是for循环的判断部分如果被省略，那判断条件就是恒为
但是不建议初学时省略，容易导致问题*/

//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 10; j++)
//		{
//			printf("hehe\n");//100个hehe
//		}
//	}
//	return 0;
//}
//
//int main()
//{
//	int i = 0;
//	int j = 0;
//	for (; i < 10; i++)
//	{
//
//		for (; j < 10; j++)
//		{
//			printf("hehe\n");//10个hehe，i=0时执行j的循环，j的循环结束后，该执行i++了，此时i=1，但是j并没有赋初值，所以j=10不符合条件不执行
//		}
//	}
//	return 0;
//}


//代码2
//int main()
//{
//	int x , y;
//	for (x = 0, y = 0; x < 2 && y < 5; ++x, y++);
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}

// 一道笔试题：
//请问循环要循环多少次？
//#include <stdio.h>
//int main()
//{
//	int i = 0;
//	int k = 0;
//	for (i = 0, k = 0; k = 0; i++, k++)//k=0并不是判断语句，而是赋值语句，即把k赋值0，而0为假，因此不会执行循环，非0就会死循环
//		k++;
//	return 0;
//}