//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>


//do语句的语法：
//do
//循环语句;
//while (表达式);
//do语句的特点
//循环至少执行一次，使用的场景有限，所以不是经常使用。

//先执行，后判断--倒装句
//int main()
//{
//	int i = 1;
//	do
//	{
//		printf("%d ", i);
//		i++;
//	} 
//	while (i <= 10);
//	return 0;
//}


//------------------------------------------------------------------
//do while循环中的break和continue
//int main()
//{
//	int i = 1;
//
//	do
//	{
//		if (i==5)
//			break;
//		printf("%d\n", i);//当i=5时，结束循环
//		i++;
//	} 
//	while (i <= 10);
//
//	return 0;
//}

//int main()
//{
//	int i = 1;
//
//	do
//	{
//		if (5 == i)
//			continue;
//		printf("%d\n", i);//1、2、3、4死循环
//		i++;
//	} 
//	while (i < 10);
//
//	return 0;
//}