//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

//比较三个数的大小
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d %d %d", &a, &b, &c);
//	//算法实现，a中放最大值，b次之，c放最小值
//	if (a < b)
//	{
//		int tmp = a;
//		a = b;
//		b = tmp;
//	}
//	if (a < c)
//	{
//		int tmp = a;
//		a = c;
//		c = tmp;
//	}
//	if (b < c)
//	{
//		int tmp = b;
//		b = c;
//		c = tmp;
//	}
//	printf("%d %d  %d", a, b, c);
//
//	return 0;
//}

//打印100以内能被3整除的数字
//int main()
//{
//	int i = 0;
//	for (i = 0; i <= 100; i++)
//	{
//		if (i % 3 == 0)
//			printf("%d  ", i);
//	}
//	return 0;
//}



//求两个数的最大公约数

//用辗转相除法来求解这道题目
//
//先用小的一个数除大的一个数, 得第一个余数；
//再用第一个余数除小的一个数, 得第二个余数；
//又用第二个余数除第一个余数, 得第三个余数；
/*1、我们计算10和25的最大公约数。用辗转相除法是这么计算的：
25÷10 = 2······5
10÷5 = 2······0
那么25和10的最大公约数就是5。

2、比如说120和48的最大公约数，我们用辗转相除法可以这么做：
120÷48 = 2······24
48÷24 = 2······0
所以120和48的最大公约数是24。

3、一般形式
a÷b = c1 ··· d；
b÷d = c2 ··· e;
d÷e = c3 ··· f;
·
·
·
一直到
m÷n = c4 ··· 0；
那么n就是a和b的最大公约数；*/

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d%d", &a, &b);
//	while (c = a % b)
//	{
//		a = b;
//		b = c;
//	}
//	printf("%d是最大公约数\n", b);
//}


//打印闰年
//闰年的置闰规则：
//普通闰年：公历年份是4的倍数，且不是100的倍数的，为闰年。
//世纪闰年：公历年份是整百数的，必须是400的倍数才是闰年。
//int main()
//{
//	int year = 0;
//	int count = 0;
//	for (year = 1000; year <= 2000; year++)
//	{
//		if (year % 4 == 0 && year % 100 != 0)
//		{
//			printf("%d ", year);
//			count++;
//		}
//		else if (year % 400 == 0)
//		{
//			printf("%d ", year);
//			count++;
//		}
//	}
//	printf("\ncount%d\n", count);
//	return 0;
//}

//int main()
//{
//	int year = 0;
//	int count = 0;
//	for (year = 1000; year <= 2000; year++)
//	{
//		if (((year % 4 == 0) && (year % 1000 != 0)) || (year % 400 == 0))
//		{
//			printf("%d ", year);
//			count++;
//		}
//	}
//	printf("\ncount%d\n", count);
//	return 0;
//}

//打印100~200之间的素数
//试除法：判断一个整数m是否是素数，只需把 m 被 2 ~ m-1 之间的每一个整数去除，
//如果都不能被整除，那么 m 就是一个素数。

//int main()
//{
//	int i = 0;
//	int count = 0;
//	for (i = 100; i <= 200; i++)
//	{
//		int j = 0;
//		for(j = 2; j < i; j++)
//		{
//			if (i % j == 0)
//			{
//				break;
//			}
//		}
//		if (j == i)
//		{
//			printf("%d ", i);
//			count++;
//		}
//	}
//	printf("\ncount =%d\n", count);
//	return 0;
//}


//判断素数的方法：用一个数分别去除2到sqrt(这个数)，如果能被整除，则表明此数不是素数，反之是素数。
//(原因：素数是因子为1和本身，如果数c不是素数，则还有其他因子，其中的因子，假如为a, b.其中必有一个大于sqrt(c) ，一个小于sqrt(c) 。
//	所以m必有一个小于或等于其平方根的因数，那么验证素数时就只需要验证到其平方根就可以了。即一个合数一定含有小于它平方根的质因子)


//#include <math.h>
//int main()
//{
//	int i = 0;
//	int count = 0;
//	//for (i = 100; i <= 200; i++)
//	for (i = 101; i <= 200; i+=2)//偶数一定不是素数，因此跳过偶数，效率提高一半
//	{
//		int j = 0;
//		for (j = 2; j <=sqrt(i); j++)
//		{
//			if (i % j == 0)
//			{
//				break;
//			}
//		}
//		if (j>=sqrt(i))
//		{
//			count++;
//			printf("%d ", i);
//			
//		}
//	}
//	printf("\ncount =%d\n", count);
//	return 0;
//}


