///*
//题目：有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少
// 
// 程序分析：可填在百位、十位、个位的数字都是1、2、3、4。组成所有的排列后再去掉不满足条件的排列。
//*/  
////#include <stdio.h>
////int main()
////{
////    int i, j, k;
////    printf("互不相同且无重复数字的三位数为\n");
////    for (i = 1; i < 5; i++) /*以下为三重循环*/
////    {
////        for (j = 1; j < 5; j++)
////        {
////            for (k = 1; k < 5; k++)
////            {
////                if (i != k && i != j && j != k) /*确保i、j、k三位互不相同*/
////                {
////                    printf("%d%d%d\n", i, j, k);
////                }
////            }
////        }
////    }
////    return 0;
////}
//#include <stdio.h>
//int main()
//{
//    int no = 0;
//    int count = 0;
//    int i, j, k = 0;
//    for (i = 1; i < 6; i++)
//    {
//        for (j = 1; j < 6; j++)
//        {
//            for (k = 1; k < 6; k++)
//            {
//                if (i != j && i != k && j != k)
//                {
//                    no++;
//                    printf("%d、%d%d%d\n",no,i, j, k);
//                    count++;
//                }
//            }
//        }
//    }
//    printf("共有%d个\n", count);
//    return 0;
//}