//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

/*
算术操作符
1. 除了 % 操作符之外，其他的几个操作符可以作用于整数和浮点数。
2. 对于 / 操作符如果两个操作数都为整数，执行整数除法。而只要有浮点数执行的就是浮点数除法。
3. % 操作符的两个操作数必须为整数。返回的是整除之后的余数。
*/

//int main()
//{
//	int a = 5 / 2;//商2余1,除号两边都是整型，输出的也是整型
//	int b = 5 / 2.0;//除号两边有一个数是浮点型，输出的就是浮点型
//	int c = 5.0 / 2;
//	int d = 5 % 2;//%两边必须是整型
//	printf("a=%d\n b=%d\n c=%d\n d=%d", a,b,c,d);
//	return 0;
//}