//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>


/*
位操作符有：
&  按位与
|  按位或
^  按位异或
注：他们的操作数必须是整数
*/ 

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a & b; //& - 按位与 - 按二进制补码位与 
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001 - 有一个0就是0，都为1才是1 - 1
//	int d = a | b;//| - 按位或 - 按二进制补码位或 
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111 - 有一个1就是1，都为0才是0 - 7
//	int e = a ^ b;//^ - 按位异或 - 按二进制补码异或
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110 - 相同为0，相异为1 - 6
//	printf("c=%d\n d=%d\n" ,c,d,e);
//	return 0;
//}

/*
一道变态的面试题：
不能创建临时变量（第三个变量），实现两个数的交换
*/

//加减法 - 只能处理较小的数 - 可能会溢出
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a = a + b;//a = 30
//	b = a - b;//b = 10
//	a = a - b;//a = 30 - 10 = 20
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}

//异或法
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a = a ^ b;//a = 01010 ^ 10100 = 11110
//	b = a ^ b;//b = 11110 ^ 10100 = 01010
//	a = a ^ b;//a = 11110 ^ 01010 = 10100
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}

/*
练习：
编写代码实现：求一个整数存储在内存中的二进制中1的个数
*/
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	//统计num的补码中有几个1,显然无法处理负数
//	while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}
//	printf("%d\n", count);
//}

//方法2：
//#include <stdio.h>
//int main()
//{
//	int num = -1;
//	int i = 0;
//	int count = 0;//计数
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == (( num >> i) & 1))//与1按位与，然后右移,以此类推，每一位都与1按位与
//			count++;
//	}
//	printf("二进制中1的个数 = %d\n", count);
//	return 0;
//}


//方法3：
//#include <stdio.h>
//int main()
//{
//	int num = -1;
//	int i = 0;
//	int count = 0;//计数
//	while (num)
//	{
//		count++;
//		num = num & (num - 1);
//	}
//	printf("二进制中1的个数 = %d\n", count);
//	return 0;
//}
