//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

/*
赋值操作符
赋值操作符是一个很棒的操作符，他可以让你得到一个你之前不满意的值。也就是你可以给自己重新赋值
*/ 
//int main()
//{
//	int weight = 120;//体重
//	weight = 89;//不满意就赋值
//	double salary = 10000.0;
//	salary = 20000.0;//使用赋值操作符赋值
//	/*赋值操作符可以连续使用，比如：*/
//	int a = 10;
//	int x = 0;
//	int y = 20; 
//	a = x = y + 1;//连续赋值
//	/*同样的语义，你看看：*/
//	x = y + 1; 
//	a = x;
//	/*这样的写法更加清晰爽朗而且易于调试。*/
//	return 0;
//}
//---------------------------------------------------------------------------
/*
复合赋值符
+=
-=
*=
/=
%=
>>=
<<=
&=
|=
^=
这些运算符都可以写成复合的效果
*/
//int main()
//{
//	int x = 10; 
//	x = x + 10; 
//	x += 10;//复合赋值
//    //其他运算符一样的道理。这样写更加简洁。
//	return 0;
//}

