//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
/*
单目操作符介绍
!        逻辑反操作
-        负值
+        正值
&        取地址
sizeof   操作数的类型长度（以字节为单位）
~        对一个数的二进制按位取反
--       前置、后置--
++       前置、后置++
*        间接访问操作符(解引用操作符) 
(类型)   强制类型转换*/ 

//int main()
//{
//	int a = 10;
//	printf("%d\n", !a);//0 - !把真值变假，假值变真
//	int a = 0;
//	if (a)//a为真，打印hehe
//	{
//		printf("hehe\n");
//	}
//	return 0;
//
//
//	if (!a)//a为假，打印hehe
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}

//---------------------------------------------------------------------------
//取地址  解引用
//int main()
//{
//	int a = 10;
//	int* p = &a;//& - 取地址操作符
//	*p=20;//* - 解引用操作符
//	return 0;
//}



//------------------------------------------------------------------------------
// sizeof   操作数的类型长度（以字节为单位）
//int main()
//{
//	short s = 0;
//	int a = 0;
//	printf("%d\n", sizeof(s = a + 5));
//	printf("%d\n", s);
//	int a = 20;
//	char c = 'r';
//	char* p = &c;
//	int arr[10] = { 0 };
//	//sizeof计算的变量所占内存空间的大小，单位是字节
//	printf("%d\n", sizeof(a));//等价于printf("%d\n", sizeof a)，()可以省略
//	printf("%d\n", sizeof(int));//sizeof()如果是类型，不能省略()
//
//	printf("%d\n", sizeof(c));
//	printf("%d\n", sizeof(char));
//
//	printf("%d\n", sizeof(p));
//	printf("%d\n", sizeof(char*));
//
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(int [10]));//去掉数组名就是数组的类型
//
//	return 0;
//}

//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//放到s里，还是短整型 - 2个字节
//	printf("%d\n", s);//sizeof里的表达式不参与运算 - 还是0
//	return 0;
//}

//----------------------------------------------------------------------------
//~对一个数的二进制按位取反

//int main()
//{
//	int a = 0;     //整型4个字节=32bit位       00000000000000000000000000000000
//	int b = ~a;    //b是有符号的整型，第一位是符号位，0为正，1为负
//	//原码、反码、补码，只要是整数，内存中存储的都是二进制的补码
//	//原码：直接按照正负写出的二进制序列；原码符号位不变，其余取反，得到反码，反码+1得到补码
//	//~对一个数的二进制按位取反 11111111111111111111111111111111
//	//补码：11111111111111111111111111111111
//	//反码：11111111111111111111111111111110
//	//原码：10000000000000000000000000000001 --> -1
//	//负数在内存中存储的时候，存储的是二进制的补码
//	//正数--原码、反码、补码相同
//	//-2
//	//原码：100000000000000000000000000010
//	//反码：111111111111111111111111111101
//	//补码：111111111111111111111111111110
//	printf("%d", b);//打印的是这个数的原码
//	return 0;
//}

//int main()
//{
//	int b = 0;
//	int a = 11;     
//	a = a | (1 << 2);//15
//	//000000000000000000000000000001 - 1<<2 - 000000000000000000000000000100
//	//000000000000000000000000001011 | 000000000000000000000000000100 = 000000000000000000000000001111
//	b = a & (~(1 << 2));//11
//	//~000000000000000000000000000100 = 111111111111111111111111111011
//	//000000000000000000000000001111 & 111111111111111111111111111011 = 000000000000000000000000001011
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}

//-----------------------------------------------------------------------------------
/*
--前置、后置--
++前置、后置++
*/ 

//int main()
//{
//	int a = 10;
//	int b1 = a++;//后置++，先使用，再++(a的值先赋给b，a再加1)  //b1=10 a=11
//	int b2 = ++a;//前置++，先++，在使用(a先加一，再赋值给b)    //a=11 b2=11
//	int b3 = a--;//后置--，先使用，再--(a的值先赋给b，a再减1)    //b3=10 a=9
//	int b4 = --a;//前置--，先--，再使用(a先减一，再赋值给b)      //a=9 b4=9
//	printf("a=%d b1=%d b2=%d b3=%d b4=%d\n", a, b1,b2,b3,b4);
//	return 0;
//}

//-------------------------------------------------------------------------------------------------------------
//(类型)强制类型转换
//int main()
//{
//	//int a = 3.14;//报错3.14为double类型
//	int a = (int)3.14;//强制类型转换，将double类型强制转换为int类型
//	printf("%d", a);
//	return 0;
//}

//-----------------------------------------------------------------------------------------
//练习
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2) - 首元素地址 - 指针 - 8
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4) - 首元素地址 - 指针 -  8
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1) - 40
//	printf("%d\n", sizeof(ch));//(3) - 10
//	test1(arr);
//	test2(ch);
//	return 0;
//}
/*
问：
（1）、（2）两个地方分别输出多少？
（3）、（4）两个地方分别输出多少？
*/ 