//我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
//一个人写的烂软件将会给另一个人带来一份全职工作。
//除非我不想赢，否则没有人能让我输！！！
//一鼓作气，考研是一种忍耐！！！
#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>

/*
逻辑操作符
逻辑操作符有哪些：
&& 逻辑与
|| 逻辑或
区分逻辑与和按位与
区分逻辑或和按位或
1 & 2----->0 
1 && 2---- > 1 
1 | 2----->3 
1 || 2---- > 1
*/

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a && b;//都真则真
//	int d = a || b;//都假则假
//	printf("c=%d d=%d\n", c, d);
//	return 0;
//}

//360笔试题
//练习： 
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;//a++先使用再++，a=0为假，&&就不再参与运算，所以b.d值不变
//	//i = a++||++b||d++;
//	printf(" a = %d\n b = %d\n c = %d\n d = %d\n", a, b, c, d);
//	return 0;
//}
//程序输出的结果是什么？